trade_exp/src/DataProcessors/НастройкаПоддержанияЗапасов/НастройкаПоддержанияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НастройкаПоддержанияЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Формат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ТоварныеОграничения/ТоварныеОграничения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварныеОграничения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>НормаПотребления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>УпаковкаЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ОбеспечениеЗаказовПриПоддержанииЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СреднедневноеПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СреднееОтклонениеПотребления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МетодОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СтраховоеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>МинимальноеКоличествоЗапаса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>АлгоритмРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="79e85354-95b1-4fa4-912d-e98823eec07c">
    <name>ПределМИН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="33ce8317-c35e-4bb4-9e22-34e5046989ad">
    <name>ПределМАКС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЕстьРекомендацияПоИзменению</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭтоГруппировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРасчетаРекомендаций</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЭтоДействующийПараметр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="78280a32-83cd-4d53-9f8a-a6d612ce998a">
    <name>ГруппировкаТоварныхОграничений</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ИсторияИзмененияФорматовМагазинов/ИсторияИзмененияФорматовМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84660b7-72f0-44e7-bf86-4d9eb83aa399">
  <name>ИсторияИзмененияФорматовМагазинов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="bf6c1142-f3d7-46a2-996c-699808e97791">
    <name>ФорматМагазина</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ede5df11-be21-4458-8952-9d8700d2b41b">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ВариантыОбеспеченияТоварами/ВариантыОбеспеченияТоварами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7da1b5e1-331e-4dd0-befe-6664dd86bf92">
  <name>ВариантыОбеспеченияТоварами</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <attributes extendedConfigurationObject="03ede1e8-d277-49f1-926b-78a209555ecc">
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="7966bf8b-8dea-418d-8153-75858f8d495b">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bf6a614-5a3a-48cc-90b9-3fd965f34119">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ea23be2e-cdd4-4995-97a6-35c922d01fb1">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="de53f388-f0a3-4995-b44a-085f5e521468">
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СхемыОбеспечения/СхемыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b157cccb-0cb1-4029-8f09-a62c4d4e1164">
  <name>СхемыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="5da4b51d-57c6-4670-8a69-8e0012e8f1af">
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="40633447-ab76-4ab7-81f9-c3078ba49285">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="00496df6-80bd-4b8d-a4bb-48bc2c22f04c">
    <name>СхемаОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ИзменениеАссортимента/ИзменениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="088ef687-1ea4-4570-b52a-31cf8dad179d">
  <name>ИзменениеАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b7b4f69b-06b0-4155-9664-4e812de52b9d">
    <name>ОбъектПланирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="bad7dc37-a78f-4a01-a0c8-c7573c8f71d3">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e6e8b383-1a7b-4037-b337-3fb424b25167">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/СпособыОбеспеченияПотребностей/СпособыОбеспеченияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыОбеспеченияПотребностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ИсточникОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлительностьВДнях</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбеспечиваемыйПериод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладыОстаток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1a588fbb-93f6-471a-a3fa-1f69415a44cd">
    <name>КодОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd64f887-2c74-4726-9739-1f9f577a1c46">
    <name>ГарантированныйСрокОбеспечения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/НастройкаПоддержанияЗапасов/Forms/Форма/Module.bsl
&НаСервере
Процедура ОП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
МодифицироватьЗапрос();	
КонецПроцедуры   
&НаСервере
Процедура СоздатьЗапрос()

	 СписокПоддерживаемыхЗапасов.ТекстЗапроса=  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ТоварныеОграниченияПереопределяемый.ГруппировкаТоварныхОграничений КАК ГруппировкаТоварныхОграничений,
|	ТоварныеОграниченияПереопределяемый.Номенклатура КАК Номенклатура,
|	ТоварныеОграниченияПереопределяемый.Характеристика КАК Характеристика,
|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	ТоварныеОграниченияПереопределяемый.Склад КАК Склад,
|	ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, ТоварныеОграниченияПереопределяемый.МетодОбеспеченияПотребностей) КАК ПоддержаниеЗапаса,
|	ЕСТЬNULL(НастройкаГруппировки.МинимальноеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.МинимальноеКоличествоЗапаса) КАК МинимальныйЗапас,
|	ЕСТЬNULL(НастройкаГруппировки.МаксимальноеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.МаксимальноеКоличествоЗапаса) КАК МаксимальныйЗапас,
|	ЕСТЬNULL(НастройкаГруппировки.ПределМИН, ТоварныеОграниченияПереопределяемый.ПределМИН) КАК ПределМИН,
|	ЕСТЬNULL(НастройкаГруппировки.ПределМАКС, ТоварныеОграниченияПереопределяемый.ПределМАКС) КАК ПределМАКС,
|	ЕСТЬNULL(НастройкаГруппировки.СтраховоеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.СтраховоеКоличествоЗапаса) КАК СтраховойЗапас,
|	ЕСТЬNULL(НастройкаГруппировки.НормаПотребления, ТоварныеОграниченияПереопределяемый.НормаПотребления) КАК НормаПотребления,
|	ЕСТЬNULL(НастройкаГруппировки.ОбеспечениеЗаказовПриПоддержанииЗапаса, ТоварныеОграниченияПереопределяемый.ОбеспечениеЗаказовПриПоддержанииЗапаса) КАК ОбеспечениеЗаказов,
|	ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление КАК СреднедневноеПотребление,
|	ВЫБОР
|		КОГДА ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление > 0
|			ТОГДА ТоварныеОграниченияПереопределяемый.СреднееОтклонениеПотребления / ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление * 100
|		ИНАЧЕ 0
|	КОНЕЦ КАК ОтклонениеПотребления,
|	ВЫБОР
|		КОГДА ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление > 0
|				И ТоварныеОграниченияПереопределяемый.СреднееОтклонениеПотребления < 0.05 * ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление
|			ТОГДА &РекомендацияПоддерживать
|		ИНАЧЕ &РекомендацияНеПоддерживать
|	КОНЕЦ КАК Рекомендация,
|	СпрСпособ.Ссылка КАК СпособОбеспечения,
|	СпрСпособ.СрокИсполненияЗаказа КАК СрокПоставки,
|	СпрСпособ.ОбеспечиваемыйПериод КАК ОбеспечиваемыйПериод,  
|  	СпрСпособ.ВариантОбеспечиваемогоПериода КАК ВариантОбеспечиваемогоПериода,
|	СпрСпособ.ИсточникОбеспеченияПотребностей КАК ИсточникОбеспечения,
|	СпрСпособ.ТипОбеспечения КАК ТипОбеспечения,
|	СпрНоменклатура.СхемаОбеспечения КАК СхемаОбеспечения,
|	СпрФорматы.ФорматМагазина КАК ФорматМагазина,
|	ТоварныеОграниченияПереопределяемый.ЭтоГруппировка КАК ЭтоГруппа,
|	СпрНоменклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) КАК ХарактеристикиИспользуются,
|	ВЫБОР
|		КОГДА ТоварныеОграниченияПереопределяемый.ЭтоГруппировка
|			ТОГДА &РежимОтображения
|		КОГДА ТоварныеОграниченияПереопределяемый.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
|				И СпрНоменклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
|			ТОГДА 4
|		ИНАЧЕ 3
|	КОНЕЦ КАК Картинка,
|	&ЭтоРежимРекомендаций КАК ЭтоРежимРекомендаций,
|	ИСТИНА КАК ПолеИстина,
|	&АлгоритмРасчета КАК АлгоритмРасчета
|{ВЫБРАТЬ
|	ГруппировкаТоварныхОграничений.*,
|	Номенклатура.*,
|	Характеристика.*,
|	ЕдиницаИзмерения.*,
|	Склад.*,
|	ПоддержаниеЗапаса,
|	МинимальныйЗапас,
|	МаксимальныйЗапас,
|	ПределМИН,
|	ПределМАКС,
|	СтраховойЗапас,
|	НормаПотребления,
|	ОбеспечениеЗаказов,
|	СреднедневноеПотребление,
|	ОтклонениеПотребления,
|	Рекомендация,
|	СрокПоставки,
|	ОбеспечиваемыйПериод,
|   ВариантОбеспечиваемогоПериода,
|	ИсточникОбеспечения,
|	АлгоритмРасчета}
|ИЗ
|	РегистрСведений.ТоварныеОграничения КАК ТоварныеОграниченияПереопределяемый
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
|		ПО ТоварныеОграниченияПереопределяемый.Номенклатура = СпрНоменклатура.Ссылка
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияФорматовМагазинов.СрезПоследних(, ) КАК СпрФорматы
|		ПО (СпрФорматы.Склад = ТоварныеОграниченияПереопределяемый.Склад)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыОбеспеченияТоварами КАК ТаблицаВариантыОбеспеченияТоварами
|		ПО (ТаблицаВариантыОбеспеченияТоварами.Номенклатура = ТоварныеОграниченияПереопределяемый.Номенклатура)
|			И (ТаблицаВариантыОбеспеченияТоварами.Характеристика = ТоварныеОграниченияПереопределяемый.Характеристика)
|			И (ТаблицаВариантыОбеспеченияТоварами.Склад = ТоварныеОграниченияПереопределяемый.Склад)
|			И (ТаблицаВариантыОбеспеченияТоварами.РеквизитДопУпорядочивания = 1)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ТаблицаСхемыОбеспеченияСкладов
|		ПО (ТаблицаСхемыОбеспеченияСкладов.СхемаОбеспечения = СпрНоменклатура.СхемаОбеспечения)
|			И (ТаблицаСхемыОбеспеченияСкладов.Склад = ТоварныеОграниченияПереопределяемый.Склад)
|			И (ТаблицаВариантыОбеспеченияТоварами.Номенклатура ЕСТЬ NULL)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыОбеспечения КАК ТаблицаСхемыОбеспеченияФорматов
|		ПО (ТаблицаСхемыОбеспеченияФорматов.СхемаОбеспечения = СпрНоменклатура.СхемаОбеспечения)
|			И (ТаблицаСхемыОбеспеченияФорматов.Склад = СпрФорматы.ФорматМагазина)
|			И (ТаблицаСхемыОбеспеченияСкладов.СхемаОбеспечения ЕСТЬ NULL)
|			И (ТаблицаВариантыОбеспеченияТоварами.Номенклатура ЕСТЬ NULL)
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОбеспеченияПотребностей КАК СпрСпособ
|		ПО (ЕСТЬNULL(ТаблицаВариантыОбеспеченияТоварами.СпособОбеспеченияПотребностей, ЕСТЬNULL(ТаблицаСхемыОбеспеченияСкладов.СпособОбеспеченияПотребностей, ЕСТЬNULL(ТаблицаСхемыОбеспеченияФорматов.СпособОбеспеченияПотребностей, ЗНАЧЕНИЕ(Справочник.СпособыОбеспеченияПотребностей.ПустаяСсылка)))) = СпрСпособ.Ссылка)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК НастройкаГруппировки
|		ПО (НастройкаГруппировки.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
|			И (НастройкаГруппировки.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
|			И (НастройкаГруппировки.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
|			И (НастройкаГруппировки.ГруппировкаТоварныхОграничений = ТоварныеОграниченияПереопределяемый.ГруппировкаТоварныхОграничений)
|			И (НастройкаГруппировки.ЭтоДействующийПараметр)
|ГДЕ
|	&РежимПросмотра
|	И &РежимРекомендаций
|{ГДЕ
|	(СпрНоменклатура.ТоварнаяКатегория = &ТоварнаяКатегория
|			ИЛИ ТоварныеОграниченияПереопределяемый.ЭтоГруппировка) КАК Поле2,
|	(СпрФорматы.ФорматМагазина = &ФорматМагазина
|			ИЛИ ТоварныеОграниченияПереопределяемый.ЭтоГруппировка) КАК Поле4,
|	(ТоварныеОграниченияПереопределяемый.Номенклатура В
|			(ВЫБРАТЬ
|				Сегменты.Номенклатура
|			ИЗ
|				РегистрСведений.НоменклатураСегмента КАК Сегменты
|			ГДЕ
|				Сегменты.Сегмент = &СегментНоменклатуры)) КАК Поле6,
|	((ТоварныеОграниченияПереопределяемый.Номенклатура, ТоварныеОграниченияПереопределяемый.Склад) В
|			(ВЫБРАТЬ
|				ИзменениеАссортиментаТовары.Номенклатура КАК Номенклатура,
|				ЕСТЬNULL(Форматы.Склад, ИзменениеАссортимента.ОбъектПланирования) КАК Склад
|			ИЗ
|				Документ.ИзменениеАссортимента КАК ИзменениеАссортимента
|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеАссортимента.Товары КАК ИзменениеАссортиментаТовары
|					ПО
|						ИзменениеАссортиментаТовары.Ссылка = ИзменениеАссортимента.Ссылка
|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияФорматовМагазинов.СрезПоследних КАК Форматы
|					ПО
|						Форматы.ФорматМагазина = ИзменениеАссортимента.ОбъектПланирования
|			ГДЕ
|				ИзменениеАссортимента.Ссылка = &ДокументИзмененияАссортимента)) КАК Поле8,
|	ТоварныеОграниченияПереопределяемый.Номенклатура.* КАК Номенклатура,
|	ТоварныеОграниченияПереопределяемый.Характеристика.* КАК Характеристика,
|	СпрНоменклатура.ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
|	ТоварныеОграниченияПереопределяемый.Склад.* КАК Склад,
|	(ЕСТЬNULL(НастройкаГруппировки.МетодОбеспеченияПотребностей, ТоварныеОграниченияПереопределяемый.МетодОбеспеченияПотребностей)).* КАК ПоддержаниеЗапаса,
|	(ЕСТЬNULL(НастройкаГруппировки.МинимальноеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.МинимальноеКоличествоЗапаса)) КАК МинимальныйЗапас,
|	(ЕСТЬNULL(НастройкаГруппировки.МаксимальноеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.МаксимальноеКоличествоЗапаса)) КАК МаксимальныйЗапас,
|	(ЕСТЬNULL(НастройкаГруппировки.ПределМИН, ТоварныеОграниченияПереопределяемый.ПределМИН)) КАК ПределМИН,
|	(ЕСТЬNULL(НастройкаГруппировки.ПределМАКС, ТоварныеОграниченияПереопределяемый.ПределМАКС)) КАК ПределМАКС,
|	(ЕСТЬNULL(НастройкаГруппировки.СтраховоеКоличествоЗапаса, ТоварныеОграниченияПереопределяемый.СтраховоеКоличествоЗапаса)) КАК СтраховойЗапас,
|	(ЕСТЬNULL(НастройкаГруппировки.НормаПотребления, ТоварныеОграниченияПереопределяемый.НормаПотребления)) КАК НормаПотребления,
|	(ЕСТЬNULL(НастройкаГруппировки.ОбеспечениеЗаказовПриПоддержанииЗапаса, ТоварныеОграниченияПереопределяемый.ОбеспечениеЗаказовПриПоддержанииЗапаса)).* КАК ОбеспечениеЗаказов,
|	ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление КАК СреднедневноеПотребление,
|	(ВЫБОР
|			КОГДА ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление > 0
|				ТОГДА ТоварныеОграниченияПереопределяемый.СреднееОтклонениеПотребления / ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление * 100
|			ИНАЧЕ 0
|		КОНЕЦ) КАК ОтклонениеПотребления,
|	(ВЫБОР
|			КОГДА ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление > 0
|					И ТоварныеОграниченияПереопределяемый.СреднееОтклонениеПотребления / ТоварныеОграниченияПереопределяемый.СреднедневноеПотребление < 0.05
|				ТОГДА &РекомендацияПоддерживать
|			ИНАЧЕ &РекомендацияНеПоддерживать
|		КОНЕЦ) КАК Рекомендация,
|	СпрСпособ.Ссылка.* КАК СпособОбеспечения,
|	СпрСпособ.СрокИсполненияЗаказа КАК СрокПоставки,
|	СпрСпособ.ОбеспечиваемыйПериод КАК ОбеспечиваемыйПериод,
|   СпрСпособ.ВариантОбеспечиваемогоПериода КАК ВариантОбеспечиваемогоПериода,
|	СпрСпособ.ИсточникОбеспеченияПотребностей КАК ИсточникОбеспечения,
|	СпрСпособ.ТипОбеспечения.* КАК ТипОбеспечения,
|	СпрНоменклатура.СхемаОбеспечения.* КАК СхемаОбеспечения,
|	СпрФорматы.ФорматМагазина.* КАК ФорматМагазина,
|	(СпрНоменклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)) КАК ХарактеристикиИспользуются}";	
	

КонецПроцедуры


&НаСервере
Процедура МодифицироватьЗапрос()
	
	 СписокПоддерживаемыхЗапасов.ТекстЗапроса=стрзаменить(СписокПоддерживаемыхЗапасов.ТекстЗапроса,"&АлгоритмРасчета",
	            "ЕСТЬNULL(НастройкаГруппировки.АлгоритмРасчета, ТоварныеОграниченияПереопределяемый.АлгоритмРасчета)");
	 
КонецПроцедуры

&После ("УстановитьРежимРекомендацийИПросмотра")
Процедура Док_УстановитьРежимРекомендацийИПросмотраПосле()
	МодифицироватьЗапрос();
КонецПроцедуры

&Перед ("ПриСозданииНаСервере")
&НаСервере
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СоздатьЗапрос();
КонецПроцедуры
